# Пользователь вводит строку из четырёх или более целых чисел, 
# разделённых символом “/”. Сформируйте словарь, где:
# второе и третье число являются ключами
# первое число является значением для первого ключа
# четвертое и все возможные последующие числа хранятся 
# в кортеже как значения второго ключа

numbers = input("Введите 4 числа, разделенных /: ")
numb = numbers.split('/')
numb_dict = {int(numb[1]):int(numb[0]), int(numb[2]):tuple(map(int, numb[3:]))}
print(numb_dict)